In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('duplicate.csv')
df

     name userid
0     raj    abc
1     raj    abc
2     raj    abc
3  suresh    123
4  himesh    111

In [15]:
df.duplicated()

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [13]:
df.loc[df.duplicated()]

  name userid
1  raj    abc
2  raj    abc

In [28]:
df = df.drop_duplicates()
df

     name userid  phone
0     raj    abc    123
2  himesh    abc    234
4  himesh    111    256

In [29]:
df = pd.read_csv('duplicate.csv')
df

     name userid  phone
0     raj    abc    123
1     raj    abc    123
2  himesh    abc    234
3  suresh    123    234
4  himesh    111    256

In [30]:
df = df.drop_duplicates()
df

     name userid  phone
0     raj    abc    123
2  himesh    abc    234
3  suresh    123    234
4  himesh    111    256

In [31]:
df.duplicated(subset='phone',keep=False)

0    False
2     True
3     True
4    False
dtype: bool

In [32]:
df = df.drop_duplicates(subset='phone',keep=False)
df

     name userid  phone
0     raj    abc    123
4  himesh    111    256

In [41]:
df = pd.read_csv("sales useless space.csv")
df['x'] = df['city'].str.startswith(' ')
df['y'] = df['city'].str.endswith(' ')
df.loc[ (df['x']==True)  | (df['y']==True) ]

          city  Sales      x      y
1      Noida       25  False   True
2     delhi        10   True   True
4        noiDA     50   True  False